{
    "changelog.md": {
        "Changelog Modbus": "ModBus-Änderungsprotokoll",
        "Changelog plugin Modbus": "Änderungsprotokoll des Modbus-Plugins",
        "Pour rappel s'il n'y a pas d'information sur la mise à jour, c'est que celle-ci concerne uniquement de la mise à jour de documentation, de traduction ou de texte": "Zur Erinnerung: Wenn es keine Informationen über die Aktualisierung gibt, bedeutet dies, dass es sich nur um die Aktualisierung von Dokumentation, Übersetzung oder Text handelt",
        "03\/02\/2022": "02.03.2022",
        "Version Beta, compatible 4.2.7": "Beta-Version, kompatibel mit 4.2.7",
        " IMPORTANT.": " WICHTIG.",
        " IMPORTANT?": " WICHTIG?",
        "IMPORTANT ": "WICHTIG ",
        " IMPORTANT]": " WICHTIG]",
        "[IMPORTANT]": "[WICHTIG]",
        "*IMPORTANT*": "*WICHTIG*",
        " IMPORTANT*": " WICHTIG*"
    },
    "index.md": {
        "120&1": "120&1",
        "valeuraenvoyer&nbderegistre, séparé par": "valuetosend&nbofregister, getrennt durch",
        "Plugin permettant de lire et écrire sur vos équipements ModbusTCP\/IP et RTU": "Plugin zum Lesen und Schreiben auf Ihren ModbusTCP\/IP- und RTU-Geräten",
        "Configuration du plugin": "Plugin-Setup",
        "Après téléchargement du plugin, il faut tout d'abord activer celui-ci, comme tout plugin Jeedom": "Nachdem Sie das Plugin heruntergeladen haben, müssen Sie es wie jedes Jeedom-Plugin zuerst aktivieren",
        "Ensuite, il faut lancer l'installation des dépendances (même si elles apparaissent OK": "Dann müssen Sie die Installation der Abhängigkeiten starten (auch wenn sie OK erscheinen",
        "Enfin, il faut démarrer le démon": "Starten Sie abschließend den Daemon",
        "Rien n'est à modifier dans le champ \" Port socket interne \" de la section \" Configuration": "Im Bereich „Configuration“ im Feld „Internal socket port“ muss nichts geändert werden",
        "Dans ce même onglet, il vous faut choisir la valeur du repos entre l'actualisation de vos équipements (par défaut 5 sec": "Auf derselben Registerkarte müssen Sie den Ruhewert zwischen dem Aktualisieren Ihrer Ausrüstung auswählen (standardmäßig 5 Sek",
        "Vous pouvez aussi choisir de mettre un Retry pour re-executer la requête sur une commande\/équipement qui serait en erreur (par défaut False": "Sie können auch einen Wiederholungsversuch setzen, um die Anforderung für einen Befehl\/eine Ausrüstung erneut auszuführen, die fehlerhaft wäre (standardmäßig False",
        "Vous pouvez également choisir le nombre de tentatives et le délai entre ces tentatives": "Sie können auch die Anzahl der Versuche und die Verzögerung zwischen diesen Versuchen auswählen",
        "Utilisation du plugin": "Nutzung des Plugins",
        "Pour utiliser le plugin, il vous faut connaitre les parametres de votre entrées\/sorties de vos peripheriques modbus (format des données, ordre des bits, etcc": "Um das Plugin zu verwenden, müssen Sie die Parameter Ihrer Ein-\/Ausgänge Ihrer Modbus-Peripherie kennen (Datenformat, Bitreihenfolge usw",
        "Pour les commandes, il y a des parametres a selectionner": "Für Befehle gibt es Parameter zur Auswahl",
        "Details des parametres": "Parameterdetails",
        "Valeur negative": "Negativer Wert",
        "pour les formats de type LONG\/INT, il faut preciser si la valeur en ecriture\/lecture sera negative": "für Formate vom Typ LONG\/INT müssen Sie angeben, ob der Schreib-\/Lesewert negativ sein soll",
        "il s'agit de la prise en compte ou non du decalage dans les numeros de registre sur certains equipements Modbus": "ob der Offset in den Registernummern bestimmter Modbus-Geräte berücksichtigt wird oder nicht",
        "Choisir le pas du slider": "Wählen Sie die Slider-Tonhöhe",
        "Il s'agit de choisir le pas du slider dans le cas d'une commande de type Action\/Slider si vous souhaitez envoyer des valeurs non entieres": "Hiermit wählen Sie den Schritt des Schiebereglers im Falle eines Befehls vom Typ Aktion\/Schieberegler, wenn Sie nicht ganzzahlige Werte senden möchten",
        "COMMANDES DE LECTURE": "WIEDERGABESTEUERUNG",
        "Pour les entrées Coils et Discretes Inputs": "Für Spulen und diskrete Eingänge",
        "Vous ajouter une Nouvelle Commande Modbus, et vous nommez la commande": "Sie fügen einen neuen Modbus-Befehl hinzu und benennen den Befehl",
        "Vous choisissez une commande de type Info, sous type Binaire ou Numerique": "Sie wählen einen Befehl vom Typ Info unter Binary oder Numeric type aus",
        "Choisir le fonction code correspondant": "Wählen Sie den entsprechenden Funktionscode",
        "FC01 ou FC02": "FC01 oder FC02",
        "Il faut choisir ensuite le registre de départ ainsi que le nombre de bytes a lire (le nombre de registres": "Es ist dann notwendig, das Startregister sowie die Anzahl der zu lesenden Bytes (Anzahl der Register",
        "Quand vous sauvegardez, la commande créé sera supprimée, pour créer autant de commandes que le nombre de bytes précisé": "Beim Speichern wird der erstellte Befehl gelöscht, um so viele Befehle wie die angegebene Anzahl von Bytes zu erstellen",
        "Si vous choisissiez un start register à 1 et un nombre de bytes à 4, il sera créé les commandes": "Wenn Sie ein Startregister von 1 und eine Anzahl von Bytes von 4 wählen, werden die Befehle erstellt",
        "ReadCoil_1, ReadCoil_2, ReadCoil_3, ReadCoil_4": "ReadCoil_1, ReadCoil_2, ReadCoil_3, ReadCoil_4",
        "Vous pouvez bien sur renommer ensuite les ReadCoils\/Discretes à votre convenance": "Sie können die ReadCoils\/Discretes dann natürlich nach Ihren Wünschen umbenennen",
        "Pour les Holdings Registers et les Inputs Registers": "Für Halteregister und Eingangsregister",
        "Vous choisissez une commande de type Info, sous type Numerique": "Sie wählen einen Befehl vom Typ Info unter Numerischer Typ",
        "Choisir le format correspondant": "Wählen Sie das entsprechende Format aus",
        "Float , Long\/Integer ou Bits": "Float , Long\/Integer oder Bits",
        "FC04 ou FC03": "FC04 oder FC03",
        "Le Registre de depart ainsi que le nombre de bytes": "Das Startregister sowie die Anzahl der Bytes",
        "pour les floats, le maximum de registres encodé est de 4 registres": "Für Gleitkommazahlen beträgt die maximale Anzahl codierter Register 4 Register",
        "COMMANDES D'ECRITURE": "BEFEHLE SCHREIBEN",
        "Sur votre équipements, par défaut il y aura 3 commandes de type Action\/message créées; Ecriture MultiRegistre, Ecriture Bit et Ecriture multicoils": "Auf Ihrem Gerät werden standardmäßig 3 Aktions-\/Nachrichtentyp-Befehle erstellt; Multiregister-Schreiben, Bit-Schreiben und Multicoil-Schreiben",
        "Leur principe de fonctionnement": "Ihr Funktionsprinzip",
        "Ecriture MultiRegistre": "MultiRegister-Schreiben",
        "dans la configuration de la commande, il vous faut rentrer le registre de départ, ainsi que l'ordre des bytes et word": "In der Konfiguration des Befehls müssen Sie das Startregister sowie die Reihenfolge der Bytes und des Wortes eingeben",
        "Par défaut, le fonctionCode est de fc16": "Standardmäßig ist der Funktionscode FC16",
        "Veuillez laisser cette configuration par défaut": "Bitte belassen Sie diese Konfiguration als Standard",
        "Pour changer les valeurs sur les registres, il faut utiliser cette syntaxe": "Verwenden Sie diese Syntax, um die Werte in den Registern zu ändern",
        "5&4      Nous envoyons l'entier 120 sur un registre, en partant du registre de départ configuré": "5&4 Wir senden die Ganzzahl 120 an ein Register, beginnend mit dem konfigurierten Startregister",
        "puis 214": "dann 214",
        "5 en float sur 4 registres suivant le précédent": "5 in Float auf 4 Registern, die dem vorherigen folgen",
        "Pour les types float, écrire la valeur comme ci dessus, avec un": "Schreiben Sie für Float-Typen den Wert wie oben mit a",
        "Ecriture MultiCoils": "Multicoil-Schreiben",
        "dans la configuration de la commande, il vous faut rentrer le registre de départ": "In der Konfiguration des Befehls müssen Sie das Startregister eingeben",
        "Par défaut, le fonctionCode est de fc15": "Standardmäßig ist der Funktionscode fc15",
        "01110111    Cela enverra donc à partir du registre de départ configuré les valeurs True(1) ou False(0) aux registres": "01110111 Damit werden vom konfigurierten Startregister die Werte True(1) oder False(0) an die Register gesendet",
        "Ecriture Bit": "Bit schreiben",
        "Par défaut, le fonctionCode est de fc03, car cette commande sera a donner la valeur du registre parametré en binaire à la commande info \"infobitbinary": "Standardmäßig ist der Funktionscode fc03, da dieser Befehl den Wert des Registersatzes binär an die Befehlsinfo \"infobitbinary",
        "Sur la commande info \"infobitbinary\", vous aurez la valeur binaire du registre parametre à la commande Ecriture Bit": "Beim Befehl info \"infobitbinary\" haben Sie den Binärwert des Parameterregisters beim Befehl Write Bit",
        "Pour changer le bit sur le registre": "Um das Bit im Register zu ändern",
        "valeuraenvoyer&PositionBit": "valuetosend&PositionBit",
        "1&4      Nous envoyons la valeur 1 au bit de la position 4 en partant de la droite": "1&4 Wir senden den Wert 1 an das Bit der Position 4 von rechts beginnend",
        "Sur la commande info \"infobitbinary\", vous voyez la valeur 10000101, qui correspond a la valeur binaire du registre parametre": "Auf dem Info-Befehl „infobitbinary“ sehen Sie den Wert 10000101, was dem binären Wert des Parameterregisters entspricht",
        "En ecrivant 1&6, vous aurez dorenavant la valeur": "Indem Sie 1&6 schreiben, haben Sie jetzt den Wert",
        "10100101 sur le registre parametré": "10100101 auf dem konfigurierten Register",
        "Pour écrire sur un Coil": "Auf einer Spule schreiben",
        "Exemple pour le registre 1 On": "Beispiel für Register 1 Ein",
        "Vous choisissez une commande de type Action, sous type Defaut": "Sie wählen einen Aktionstypbefehl unter Standardtyp aus",
        "Choisir Fc5 Write Single Coil": "Wählen Sie Fc5 Write Single Coil",
        "Registre de depart": "Abgangsregister",
        "Nb de bytes": "Anzahl Bytes",
        "Mettre 1 dans valeur a envoyer": "Geben Sie 1 in den zu sendenden Wert ein",
        "Exemple pour le registre 1 Off": "Beispiel für Register 1 Aus",
        "Mettre 0 dans valeur a envoyer": "Geben Sie 0 in den zu sendenden Wert ein",
        "En agissant sur ces commandes action sur votre dashboard, vous enverrez donc True ou False à vos Coils": "Indem Sie auf diese Aktionsbefehle auf Ihrem Dashboard reagieren, senden Sie daher True oder False an Ihre Coils",
        "Pour écrire sur un Holding Register": "In ein Halteregister schreiben",
        "Vous choisissez une commande de type Action, sous type Slider": "Sie wählen einen Aktionstypbefehl unter Schiebereglertyp aus",
        "Choisir Fc5 Write Single Register": "Wählen Sie Fc5 Write Single Register",
        "Choisir le nombre de registre": "Wählen Sie die Anzahl der Register",
        "1, 2 ou 4": "1, 2 oder 4",
        "Choisir le format à envoyer au registre (cela modifiera le type de slider sur votre dashboard, suivant qu'il soit float ou long\/integer": "Wählen Sie das Format, das an die Registrierung gesendet werden soll (dies ändert den Schiebereglertyp auf Ihrem Dashboard, je nachdem, ob es Float oder Long\/Integer ist",
        "Choisir le pas du slider (pour les décimales, écrire avec un": "Wählen Sie den Schritt des Schiebereglers (für Dezimalzahlen schreiben Sie mit a",
        "Choisir aussi une valeur Min et Max pour ce slider": "Wählen Sie auch einen Min- und Max-Wert für diesen Schieberegler",
        " Modbus.": " Modbus.",
        " Modbus?": " Modbus?",
        "Modbus ": "Modbus ",
        " Modbus]": " Modbus]",
        "[Modbus]": "[Modbus]",
        "*Modbus*": "*Modbus*",
        " Modbus*": " Modbus*",
        " Description.": " Beschreibung.",
        " Description?": " Beschreibung?",
        "Description ": "Beschreibung ",
        " Description]": " Beschreibung]",
        "[Description]": "[Beschreibung]",
        "*Description*": "*Beschreibung*",
        " Description*": " Beschreibung*",
        " IMPORTANT.": " WICHTIG.",
        " IMPORTANT?": " WICHTIG?",
        "IMPORTANT ": "WICHTIG ",
        " IMPORTANT]": " WICHTIG]",
        "[IMPORTANT]": "[WICHTIG]",
        "*IMPORTANT*": "*WICHTIG*",
        " IMPORTANT*": " WICHTIG*",
        " Offset.": " Versatz.",
        " Offset?": " Versatz?",
        "Offset ": "Versatz ",
        " Offset]": " Versatz]",
        "[Offset]": "[Versatz]",
        "*Offset*": "*Versatz*",
        " Offset*": " Versatz*",
        " Ex.": " Ex.",
        " Ex?": " Ex?",
        "Ex ": "Ex ",
        " Ex]": " Ex]",
        "[Ex]": "[Ex]",
        "*Ex*": "*Ex*",
        " Ex*": " Ex*",
        " ex.": " Ex.",
        " ex?": " Ex?",
        "ex ": "Ex ",
        " ex]": " Ex]",
        "[ex]": "[Ex]",
        "*ex*": "*Ex*",
        " ex*": " Ex*"
    }
}