{
    "changelog.md": {
        "Changelog Modbus": "ModBus changelog",
        "Changelog plugin Modbus": "Changelog modbus plug-in",
        "Pour rappel s'il n'y a pas d'information sur la mise à jour, c'est que celle-ci concerne uniquement de la mise à jour de documentation, de traduction ou de texte": "As a reminder, if there is no information on the update, it means that it only concerns the update of documentation, translation or text",
        "03\/02\/2022": "02\/03\/2022",
        "Version Beta, compatible 4.2.7": "Beta version, compatible with 4.2.7",
        " IMPORTANT.": " IMPORTANT.",
        " IMPORTANT?": " IMPORTANT?",
        "IMPORTANT ": "IMPORTANT ",
        " IMPORTANT]": " IMPORTANT]",
        "[IMPORTANT]": "[IMPORTANT]",
        "*IMPORTANT*": "*IMPORTANT*",
        " IMPORTANT*": " IMPORTANT*"
    },
    "index.md": {
        "120&1": "120&1",
        "valeuraenvoyer&nbderegistre, séparé par": "valuetosend&nbofregister, separated by",
        "Plugin permettant de lire et écrire sur vos équipements ModbusTCP\/IP et RTU": "Plugin for reading and writing on your ModbusTCP\/IP and RTU devices",
        "Configuration du plugin": "Plugin Setup",
        "Après téléchargement du plugin, il faut tout d'abord activer celui-ci, comme tout plugin Jeedom": "After downloading the plugin, you must first activate it, like any Jeedom plugin",
        "Ensuite, il faut lancer l'installation des dépendances (même si elles apparaissent OK": "Then, you have to start the installation of the dependencies (even if they appear OK",
        "Enfin, il faut démarrer le démon": "Finally, start the daemon",
        "Rien n'est à modifier dans le champ \" Port socket interne \" de la section \" Configuration": "Nothing needs to be changed in the \"Internal socket port\" field of the \"Configuration\" section",
        "Dans ce même onglet, il vous faut choisir la valeur du repos entre l'actualisation de vos équipements (par défaut 5 sec": "In this same tab, you must choose the rest value between updating your equipment (by default 5 sec",
        "Vous pouvez aussi choisir de mettre un Retry pour re-executer la requête sur une commande\/équipement qui serait en erreur (par défaut False": "You can also choose to put a Retry to re-execute the request on a command\/equipment that would be in error (by default False",
        "Vous pouvez également choisir le nombre de tentatives et le délai entre ces tentatives": "You can also choose the number of attempts and the delay between these attempts",
        "Utilisation du plugin": "Use of the plug-in",
        "Pour utiliser le plugin, il vous faut connaitre les parametres de votre entrées\/sorties de vos peripheriques modbus (format des données, ordre des bits, etcc": "To use the plugin, you need to know the parameters of your inputs \/ outputs of your modbus peripherals (data format, bit order, etc",
        "Pour les commandes, il y a des parametres a selectionner": "For commands, there are parameters to select",
        "Details des parametres": "Parameter details",
        "Valeur negative": "Negative value",
        "pour les formats de type LONG\/INT, il faut preciser si la valeur en ecriture\/lecture sera negative": "for LONG\/INT type formats, you must specify whether the write\/read value will be negative",
        "il s'agit de la prise en compte ou non du decalage dans les numeros de registre sur certains equipements Modbus": "this is whether or not the offset is taken into account in the register numbers on certain Modbus devices",
        "Choisir le pas du slider": "Choose the slider pitch",
        "Il s'agit de choisir le pas du slider dans le cas d'une commande de type Action\/Slider si vous souhaitez envoyer des valeurs non entieres": "This is to choose the step of the slider in the case of an Action\/Slider type command if you want to send non-integer values",
        "COMMANDES DE LECTURE": "PLAYBACK CONTROLS",
        "Pour les entrées Coils et Discretes Inputs": "For Coils and Discrete Inputs",
        "Vous ajouter une Nouvelle Commande Modbus, et vous nommez la commande": "You add a New Modbus Command, and you name the command",
        "Vous choisissez une commande de type Info, sous type Binaire ou Numerique": "You choose an Info type command, under Binary or Numeric type",
        "Choisir le fonction code correspondant": "Choose the corresponding function code",
        "FC01 ou FC02": "FC01 or FC02",
        "Il faut choisir ensuite le registre de départ ainsi que le nombre de bytes a lire (le nombre de registres": "It is then necessary to choose the starting register as well as the number of bytes to read (the number of registers",
        "Quand vous sauvegardez, la commande créé sera supprimée, pour créer autant de commandes que le nombre de bytes précisé": "When you save, the command created will be deleted, to create as many commands as the specified number of bytes",
        "Si vous choisissiez un start register à 1 et un nombre de bytes à 4, il sera créé les commandes": "If you choose a start register of 1 and a number of bytes of 4, the commands will be created",
        "ReadCoil_1, ReadCoil_2, ReadCoil_3, ReadCoil_4": "ReadCoil_1, ReadCoil_2, ReadCoil_3, ReadCoil_4",
        "Vous pouvez bien sur renommer ensuite les ReadCoils\/Discretes à votre convenance": "You can of course then rename the ReadCoils\/Discretes to your liking",
        "Pour les Holdings Registers et les Inputs Registers": "For Holdings Registers and Inputs Registers",
        "Vous choisissez une commande de type Info, sous type Numerique": "You choose an Info type command, under Numeric type",
        "Choisir le format correspondant": "Choose the corresponding format",
        "Float , Long\/Integer ou Bits": "Float , Long\/Integer or Bits",
        "FC04 ou FC03": "FC04 or FC03",
        "Le Registre de depart ainsi que le nombre de bytes": "The starting register as well as the number of bytes",
        "pour les floats, le maximum de registres encodé est de 4 registres": "for floats, the maximum number of encoded registers is 4 registers",
        "COMMANDES D'ECRITURE": "WRITE COMMANDS",
        "Sur votre équipements, par défaut il y aura 3 commandes de type Action\/message créées; Ecriture MultiRegistre, Ecriture Bit et Ecriture multicoils": "On your equipment, by default there will be 3 Action\/message type commands created; MultiRegister Write, Bit Write and Multicoil Write",
        "Leur principe de fonctionnement": "Their principle of operation",
        "Ecriture MultiRegistre": "MultiRegister Write",
        "dans la configuration de la commande, il vous faut rentrer le registre de départ, ainsi que l'ordre des bytes et word": "in the configuration of the command, you must enter the starting register, as well as the order of the bytes and word",
        "Par défaut, le fonctionCode est de fc16": "By default, the functionCode is FC16",
        "Veuillez laisser cette configuration par défaut": "Please leave this configuration as default",
        "Pour changer les valeurs sur les registres, il faut utiliser cette syntaxe": "To change the values on the registers, use this syntax",
        "5&4      Nous envoyons l'entier 120 sur un registre, en partant du registre de départ configuré": "5&4 We send the integer 120 to a register, starting from the starting register configured",
        "puis 214": "then 214",
        "5 en float sur 4 registres suivant le précédent": "5 in float on 4 registers following the previous one",
        "Pour les types float, écrire la valeur comme ci dessus, avec un": "For float types, write the value as above, with a",
        "Ecriture MultiCoils": "MultiCoil Writing",
        "dans la configuration de la commande, il vous faut rentrer le registre de départ": "in the configuration of the command, you must enter the starting register",
        "Par défaut, le fonctionCode est de fc15": "By default, the functionCode is fc15",
        "01110111    Cela enverra donc à partir du registre de départ configuré les valeurs True(1) ou False(0) aux registres": "01110111 So this will send from the configured starting register the values True(1) or False(0) to the registers",
        "Ecriture Bit": "Write Bit",
        "Par défaut, le fonctionCode est de fc03, car cette commande sera a donner la valeur du registre parametré en binaire à la commande info \"infobitbinary": "By default, the functionCode is fc03, because this command will give the value of the register set in binary to the command info \"infobitbinary",
        "Sur la commande info \"infobitbinary\", vous aurez la valeur binaire du registre parametre à la commande Ecriture Bit": "On the info \"infobitbinary\" command, you will have the binary value of the parameter register at the Write Bit command",
        "Pour changer le bit sur le registre": "To change the bit on the register",
        "valeuraenvoyer&PositionBit": "valuetosend&PositionBit",
        "1&4      Nous envoyons la valeur 1 au bit de la position 4 en partant de la droite": "1&4 We send the value 1 to the bit of position 4 starting from the right",
        "Sur la commande info \"infobitbinary\", vous voyez la valeur 10000101, qui correspond a la valeur binaire du registre parametre": "On the info command \"infobitbinary\", you see the value 10000101, which corresponds to the binary value of the parameter register",
        "En ecrivant 1&6, vous aurez dorenavant la valeur": "By writing 1&6, you will now have the value",
        "10100101 sur le registre parametré": "10100101 on the configured register",
        "Pour écrire sur un Coil": "To write on a Coil",
        "Exemple pour le registre 1 On": "Example for register 1 On",
        "Vous choisissez une commande de type Action, sous type Defaut": "You choose an Action type command, under Default type",
        "Choisir Fc5 Write Single Coil": "Choose Fc5 Write Single Coil",
        "Registre de depart": "Departure register",
        "Nb de bytes": "Number of bytes",
        "Mettre 1 dans valeur a envoyer": "Put 1 in value to send",
        "Exemple pour le registre 1 Off": "Example for register 1 Off",
        "Mettre 0 dans valeur a envoyer": "Put 0 in value to send",
        "En agissant sur ces commandes action sur votre dashboard, vous enverrez donc True ou False à vos Coils": "By acting on these action commands on your dashboard, you will therefore send True or False to your Coils",
        "Pour écrire sur un Holding Register": "To Write to a Holding Register",
        "Vous choisissez une commande de type Action, sous type Slider": "You choose an Action type command, under Slider type",
        "Choisir Fc5 Write Single Register": "Choose Fc5 Write Single Register",
        "Choisir le nombre de registre": "Choose the number of registers",
        "1, 2 ou 4": "1, 2 or 4",
        "Choisir le format à envoyer au registre (cela modifiera le type de slider sur votre dashboard, suivant qu'il soit float ou long\/integer": "Choose the format to send to the registry (this will change the type of slider on your dashboard, depending on whether it is float or long\/integer",
        "Choisir le pas du slider (pour les décimales, écrire avec un": "Choose the step of the slider (for decimals, write with a",
        "Choisir aussi une valeur Min et Max pour ce slider": "Also choose a Min and Max value for this slider",
        " Modbus.": " Modbus.",
        " Modbus?": " Modbus?",
        "Modbus ": "Modbus ",
        " Modbus]": " Modbus]",
        "[Modbus]": "[Modbus]",
        "*Modbus*": "*Modbus*",
        " Modbus*": " Modbus*",
        " Description.": " Description.",
        " Description?": " Description?",
        "Description ": "Description ",
        " Description]": " Description]",
        "[Description]": "[Description]",
        "*Description*": "*Description*",
        " Description*": " Description*",
        " IMPORTANT.": " IMPORTANT.",
        " IMPORTANT?": " IMPORTANT?",
        "IMPORTANT ": "IMPORTANT ",
        " IMPORTANT]": " IMPORTANT]",
        "[IMPORTANT]": "[IMPORTANT]",
        "*IMPORTANT*": "*IMPORTANT*",
        " IMPORTANT*": " IMPORTANT*",
        " Offset.": " Offset.",
        " Offset?": " Offset?",
        "Offset ": "Offset ",
        " Offset]": " Offset]",
        "[Offset]": "[Offset]",
        "*Offset*": "*Offset*",
        " Offset*": " Offset*",
        " Ex.": " Ex.",
        " Ex?": " Ex?",
        "Ex ": "Ex ",
        " Ex]": " Ex]",
        "[Ex]": "[Ex]",
        "*Ex*": "*Ex*",
        " Ex*": " Ex*",
        " ex.": " Ex.",
        " ex?": " Ex?",
        "ex ": "Ex ",
        " ex]": " Ex]",
        "[ex]": "[Ex]",
        "*ex*": "*Ex*",
        " ex*": " Ex*"
    }
}