{
    "changelog.md": {
        "Changelog Modbus": "Registro de cambios de ModBus",
        "Changelog plugin Modbus": "Complemento modbus de registro de cambios",
        "Pour rappel s'il n'y a pas d'information sur la mise à jour, c'est que celle-ci concerne uniquement de la mise à jour de documentation, de traduction ou de texte": "Como recordatorio, si no hay información sobre la actualización, significa que solo se trata de la actualización de la documentación, la traducción o el texto",
        "03\/02\/2022": "02\/03\/2022",
        "Version Beta, compatible 4.2.7": "Versión Beta, compatible con 4.2.7",
        " IMPORTANT.": " IMPORTANTE.",
        " IMPORTANT?": " IMPORTANTE?",
        "IMPORTANT ": "IMPORTANTE ",
        " IMPORTANT]": " IMPORTANTE]",
        "[IMPORTANT]": "[IMPORTANTE]",
        "*IMPORTANT*": "*IMPORTANTE*",
        " IMPORTANT*": " IMPORTANTE*"
    },
    "index.md": {
        "120&1": "120 y 1",
        "valeuraenvoyer&nbderegistre, séparé par": "valorparaenviar&nbofregistro, separados por",
        "Plugin permettant de lire et écrire sur vos équipements ModbusTCP\/IP et RTU": "Complemento para leer y escribir en sus dispositivos ModbusTCP\/IP y RTU",
        "Configuration du plugin": "Configuración del complemento",
        "Après téléchargement du plugin, il faut tout d'abord activer celui-ci, comme tout plugin Jeedom": "Después de descargar el complemento, primero debe activarlo, como cualquier complemento Jeedom",
        "Ensuite, il faut lancer l'installation des dépendances (même si elles apparaissent OK": "Luego, hay que iniciar la instalación de las dependencias (aunque aparezcan OK",
        "Enfin, il faut démarrer le démon": "Finalmente, inicie el demonio",
        "Rien n'est à modifier dans le champ \" Port socket interne \" de la section \" Configuration": "No es necesario cambiar nada en el campo \"Puerto de socket interno\" de la sección \"Configuración\"",
        "Dans ce même onglet, il vous faut choisir la valeur du repos entre l'actualisation de vos équipements (par défaut 5 sec": "En esta misma pestaña, deberás elegir el valor de descanso entre actualizar tu equipo (por defecto 5 seg",
        "Vous pouvez aussi choisir de mettre un Retry pour re-executer la requête sur une commande\/équipement qui serait en erreur (par défaut False": "También puede optar por poner un Reintento para volver a ejecutar la solicitud en un comando\/equipo que tendría un error (por defecto, Falso)",
        "Vous pouvez également choisir le nombre de tentatives et le délai entre ces tentatives": "También puede elegir el número de intentos y la demora entre estos intentos",
        "Utilisation du plugin": "Uso del complemento",
        "Pour utiliser le plugin, il vous faut connaitre les parametres de votre entrées\/sorties de vos peripheriques modbus (format des données, ordre des bits, etcc": "Para usar el complemento, debe conocer los parámetros de sus entradas \/ salidas de sus periféricos modbus (formato de datos, orden de bits, etc",
        "Pour les commandes, il y a des parametres a selectionner": "Para los comandos, hay parámetros para seleccionar",
        "Details des parametres": "Detalles del parámetro",
        "Valeur negative": "Valor negativo",
        "pour les formats de type LONG\/INT, il faut preciser si la valeur en ecriture\/lecture sera negative": "para formatos de tipo LONG\/INT, debe especificar si el valor de escritura\/lectura será negativo",
        "il s'agit de la prise en compte ou non du decalage dans les numeros de registre sur certains equipements Modbus": "esto es si la compensación se tiene en cuenta o no en los números de registro en ciertos dispositivos Modbus",
        "Choisir le pas du slider": "Elija el tono del control deslizante",
        "Il s'agit de choisir le pas du slider dans le cas d'une commande de type Action\/Slider si vous souhaitez envoyer des valeurs non entieres": "Esto es para elegir el paso del control deslizante en el caso de un comando de tipo Acción\/Deslizador si desea enviar valores no enteros",
        "COMMANDES DE LECTURE": "CONTROLES DE REPRODUCCIÓN",
        "Pour les entrées Coils et Discretes Inputs": "Para bobinas y entradas discretas",
        "Vous ajouter une Nouvelle Commande Modbus, et vous nommez la commande": "Agrega un nuevo comando Modbus y nombra el comando",
        "Vous choisissez une commande de type Info, sous type Binaire ou Numerique": "Elija un comando de tipo de información, en tipo binario o numérico",
        "Choisir le fonction code correspondant": "Elija el código de función correspondiente",
        "FC01 ou FC02": "FC01 o FC02",
        "Il faut choisir ensuite le registre de départ ainsi que le nombre de bytes a lire (le nombre de registres": "Entonces es necesario elegir el registro inicial así como el número de bytes a leer (el número de registros",
        "Quand vous sauvegardez, la commande créé sera supprimée, pour créer autant de commandes que le nombre de bytes précisé": "Cuando guarde, el comando creado se eliminará, para crear tantos comandos como el número de bytes especificado",
        "Si vous choisissiez un start register à 1 et un nombre de bytes à 4, il sera créé les commandes": "Si elige un registro de inicio de 1 y un número de bytes de 4, los comandos se crearán",
        "ReadCoil_1, ReadCoil_2, ReadCoil_3, ReadCoil_4": "LeerBobina_1, LeerBobina_2, LeerBobina_3, LeerBobina_4",
        "Vous pouvez bien sur renommer ensuite les ReadCoils\/Discretes à votre convenance": "Por supuesto, puede cambiar el nombre de ReadCoils\/Discretes a su gusto",
        "Pour les Holdings Registers et les Inputs Registers": "Para registros de existencias y registros de entradas",
        "Vous choisissez une commande de type Info, sous type Numerique": "Elige un comando de tipo de información, en Tipo numérico",
        "Choisir le format correspondant": "Elige el formato correspondiente",
        "Float , Long\/Integer ou Bits": "Flotante, Largo\/Entero o Bits",
        "FC04 ou FC03": "FC04 o FC03",
        "Le Registre de depart ainsi que le nombre de bytes": "El registro inicial así como el número de bytes",
        "pour les floats, le maximum de registres encodé est de 4 registres": "para flotantes, el número máximo de registros codificados es de 4 registros",
        "COMMANDES D'ECRITURE": "ESCRIBIR COMANDOS",
        "Sur votre équipements, par défaut il y aura 3 commandes de type Action\/message créées; Ecriture MultiRegistre, Ecriture Bit et Ecriture multicoils": "En su equipo, por defecto habrá 3 comandos de tipo Acción\/mensaje creados; Escritura de registro múltiple, escritura de bit y escritura de bobina múltiple",
        "Leur principe de fonctionnement": "Su principio de funcionamiento",
        "Ecriture MultiRegistre": "Escritura de registro múltiple",
        "dans la configuration de la commande, il vous faut rentrer le registre de départ, ainsi que l'ordre des bytes et word": "en la configuración del comando se debe ingresar el registro de inicio, así como el orden de los bytes y palabra",
        "Par défaut, le fonctionCode est de fc16": "Por defecto, el código de función es FC16",
        "Veuillez laisser cette configuration par défaut": "Por favor, deje esta configuración por defecto",
        "Pour changer les valeurs sur les registres, il faut utiliser cette syntaxe": "Para cambiar los valores en los registros, use esta sintaxis",
        "5&4      Nous envoyons l'entier 120 sur un registre, en partant du registre de départ configuré": "5&4 Enviamos el entero 120 a un registro, partiendo del registro inicial configurado",
        "puis 214": "entonces 214",
        "5 en float sur 4 registres suivant le précédent": "5 en float en 4 registros siguientes al anterior",
        "Pour les types float, écrire la valeur comme ci dessus, avec un": "Para tipos flotantes, escriba el valor como se indica arriba, con un",
        "Ecriture MultiCoils": "Escritura multibobina",
        "dans la configuration de la commande, il vous faut rentrer le registre de départ": "en la configuración del comando, debe ingresar el registro de inicio",
        "Par défaut, le fonctionCode est de fc15": "Por defecto, el código de función es fc15",
        "01110111    Cela enverra donc à partir du registre de départ configuré les valeurs True(1) ou False(0) aux registres": "01110111 Entonces esto enviará desde el registro de inicio configurado los valores True(1) o False(0) a los registros",
        "Ecriture Bit": "Bit de escritura",
        "Par défaut, le fonctionCode est de fc03, car cette commande sera a donner la valeur du registre parametré en binaire à la commande info \"infobitbinary": "Por defecto, el código de función es fc03, porque este comando le dará el valor del registro establecido en binario al comando info \"infobitbinary",
        "Sur la commande info \"infobitbinary\", vous aurez la valeur binaire du registre parametre à la commande Ecriture Bit": "En el comando info \"infobitbinary\", tendrá el valor binario del registro de parámetros en el comando Write Bit",
        "Pour changer le bit sur le registre": "Para cambiar el bit en el registro",
        "valeuraenvoyer&PositionBit": "valuetoend&PositionBit",
        "1&4      Nous envoyons la valeur 1 au bit de la position 4 en partant de la droite": "1&4 Enviamos el valor 1 al bit de la posición 4 empezando por la derecha",
        "Sur la commande info \"infobitbinary\", vous voyez la valeur 10000101, qui correspond a la valeur binaire du registre parametre": "En el comando de información \"infobitbinary\", verá el valor 10000101, que corresponde al valor binario del registro de parámetros",
        "En ecrivant 1&6, vous aurez dorenavant la valeur": "Al escribir 1 y 6, ahora tendrá el valor",
        "10100101 sur le registre parametré": "10100101 en el registro configurado",
        "Pour écrire sur un Coil": "Para escribir en una bobina",
        "Exemple pour le registre 1 On": "Ejemplo para registro 1 On",
        "Vous choisissez une commande de type Action, sous type Defaut": "Elige un comando de tipo Acción, en Tipo predeterminado",
        "Choisir Fc5 Write Single Coil": "Elija Fc5 Escribir bobina simple",
        "Registre de depart": "Registro de salida",
        "Nb de bytes": "Número de bytes",
        "Mettre 1 dans valeur a envoyer": "Poner 1 en valor para enviar",
        "Exemple pour le registre 1 Off": "Ejemplo de registro 1 Off",
        "Mettre 0 dans valeur a envoyer": "Poner 0 en valor para enviar",
        "En agissant sur ces commandes action sur votre dashboard, vous enverrez donc True ou False à vos Coils": "Al actuar sobre estos comandos de acción en su tablero, enviará Verdadero o Falso a sus Coils",
        "Pour écrire sur un Holding Register": "Para escribir en un registro de retención",
        "Vous choisissez une commande de type Action, sous type Slider": "Elige un comando de tipo Acción, en Tipo de control deslizante",
        "Choisir Fc5 Write Single Register": "Elija Fc5 Escribir registro único",
        "Choisir le nombre de registre": "Elige el número de registros",
        "1, 2 ou 4": "1, 2 o 4",
        "Choisir le format à envoyer au registre (cela modifiera le type de slider sur votre dashboard, suivant qu'il soit float ou long\/integer": "Elija el formato para enviar al registro (esto cambiará el tipo de control deslizante en su tablero, dependiendo de si es flotante o largo\/entero)",
        "Choisir le pas du slider (pour les décimales, écrire avec un": "Elija el paso del control deslizante (para decimales, escriba con un",
        "Choisir aussi une valeur Min et Max pour ce slider": "Elija también un valor mínimo y máximo para este control deslizante",
        " Modbus.": " Modbus.",
        " Modbus?": " Modbus?",
        "Modbus ": "Modbus ",
        " Modbus]": " Modbus]",
        "[Modbus]": "[Modbus]",
        "*Modbus*": "*Modbus*",
        " Modbus*": " Modbus*",
        " Description.": " Descripción.",
        " Description?": " Descripción?",
        "Description ": "Descripción ",
        " Description]": " Descripción]",
        "[Description]": "[Descripción]",
        "*Description*": "*Descripción*",
        " Description*": " Descripción*",
        " IMPORTANT.": " IMPORTANTE.",
        " IMPORTANT?": " IMPORTANTE?",
        "IMPORTANT ": "IMPORTANTE ",
        " IMPORTANT]": " IMPORTANTE]",
        "[IMPORTANT]": "[IMPORTANTE]",
        "*IMPORTANT*": "*IMPORTANTE*",
        " IMPORTANT*": " IMPORTANTE*",
        " Offset.": " Compensar.",
        " Offset?": " Compensar?",
        "Offset ": "Compensar ",
        " Offset]": " Compensar]",
        "[Offset]": "[Compensar]",
        "*Offset*": "*Compensar*",
        " Offset*": " Compensar*",
        " Ex.": " Ex.",
        " Ex?": " Ex?",
        "Ex ": "Ex ",
        " Ex]": " Ex]",
        "[Ex]": "[Ex]",
        "*Ex*": "*Ex*",
        " Ex*": " Ex*",
        " ex.": " Ex.",
        " ex?": " Ex?",
        "ex ": "Ex ",
        " ex]": " Ex]",
        "[ex]": "[Ex]",
        "*ex*": "*Ex*",
        " ex*": " Ex*"
    }
}