{
    "changelog.md": {
        "Changelog Modbus": "Registro de alterações do ModBus",
        "Changelog plugin Modbus": "Plug-in modbus de log de alterações",
        "Pour rappel s'il n'y a pas d'information sur la mise à jour, c'est que celle-ci concerne uniquement de la mise à jour de documentation, de traduction ou de texte": "Relembramos que, se não houver informação sobre a atualização, significa que se trata apenas de atualização de documentação, tradução ou texto",
        "03\/02\/2022": "02\/03\/2022",
        "Version Beta, compatible 4.2.7": "Versão beta, compatível com 4.2.7",
        " IMPORTANT.": " IMPORTANTE.",
        " IMPORTANT?": " IMPORTANTE?",
        "IMPORTANT ": "IMPORTANTE ",
        " IMPORTANT]": " IMPORTANTE]",
        "[IMPORTANT]": "[IMPORTANTE]",
        "*IMPORTANT*": "*IMPORTANTE*",
        " IMPORTANT*": " IMPORTANTE*"
    },
    "index.md": {
        "120&1": "120&1",
        "valeuraenvoyer&nbderegistre, séparé par": "valuetoend&nbofregister, separados por",
        "Plugin permettant de lire et écrire sur vos équipements ModbusTCP\/IP et RTU": "Plugin para leitura e escrita em seus dispositivos ModbusTCP\/IP e RTU",
        "Configuration du plugin": "Configuração do plug-in",
        "Après téléchargement du plugin, il faut tout d'abord activer celui-ci, comme tout plugin Jeedom": "Depois de baixar o plugin, você deve primeiro ativá-lo, como qualquer plugin Jeedom",
        "Ensuite, il faut lancer l'installation des dépendances (même si elles apparaissent OK": "Então, você deve iniciar a instalação das dependências (mesmo que elas apareçam OK",
        "Enfin, il faut démarrer le démon": "Finalmente, inicie o daemon",
        "Rien n'est à modifier dans le champ \" Port socket interne \" de la section \" Configuration": "Nada precisa ser alterado no campo \"Porta de soquete interna\" da seção \"Configuração\"",
        "Dans ce même onglet, il vous faut choisir la valeur du repos entre l'actualisation de vos équipements (par défaut 5 sec": "Nesta mesma aba, você deve escolher o valor de descanso entre atualizar seu equipamento (por padrão 5 seg",
        "Vous pouvez aussi choisir de mettre un Retry pour re-executer la requête sur une commande\/équipement qui serait en erreur (par défaut False": "Você também pode optar por colocar um Retry para reexecutar a solicitação em um comando\/equipamento que estaria em erro (por padrão False",
        "Vous pouvez également choisir le nombre de tentatives et le délai entre ces tentatives": "Você também pode escolher o número de tentativas e o atraso entre essas tentativas",
        "Utilisation du plugin": "Uso do plug-in",
        "Pour utiliser le plugin, il vous faut connaitre les parametres de votre entrées\/sorties de vos peripheriques modbus (format des données, ordre des bits, etcc": "Para usar o plugin, você precisa conhecer os parâmetros de suas entradas\/saídas de seus periféricos modbus (formato de dados, ordem de bits, etc",
        "Pour les commandes, il y a des parametres a selectionner": "Para comandos, existem parâmetros para selecionar",
        "Details des parametres": "Detalhes do parâmetro",
        "Valeur negative": "Valor negativo",
        "pour les formats de type LONG\/INT, il faut preciser si la valeur en ecriture\/lecture sera negative": "para formatos do tipo LONG\/INT, você deve especificar se o valor de gravação\/leitura será negativo",
        "il s'agit de la prise en compte ou non du decalage dans les numeros de registre sur certains equipements Modbus": "isto é, se o deslocamento é ou não considerado nos números de registro em determinados dispositivos Modbus",
        "Choisir le pas du slider": "Escolha o tom do controle deslizante",
        "Il s'agit de choisir le pas du slider dans le cas d'une commande de type Action\/Slider si vous souhaitez envoyer des valeurs non entieres": "Isto serve para escolher o passo do cursor no caso de um comando do tipo Action\/Slider se quiser enviar valores não inteiros",
        "COMMANDES DE LECTURE": "CONTROLES DE REPRODUÇÃO",
        "Pour les entrées Coils et Discretes Inputs": "Para bobinas e entradas discretas",
        "Vous ajouter une Nouvelle Commande Modbus, et vous nommez la commande": "Você adiciona um Novo Comando Modbus e nomeia o comando",
        "Vous choisissez une commande de type Info, sous type Binaire ou Numerique": "Você escolhe um comando de tipo de informação, em tipo binário ou numérico",
        "Choisir le fonction code correspondant": "Escolha o código de função correspondente",
        "FC01 ou FC02": "FC01 ou FC02",
        "Il faut choisir ensuite le registre de départ ainsi que le nombre de bytes a lire (le nombre de registres": "É então necessário escolher o registrador inicial bem como o número de bytes a serem lidos (o número de registradores",
        "Quand vous sauvegardez, la commande créé sera supprimée, pour créer autant de commandes que le nombre de bytes précisé": "Ao salvar, o comando criado será excluído, para criar tantos comandos quanto o número especificado de bytes",
        "Si vous choisissiez un start register à 1 et un nombre de bytes à 4, il sera créé les commandes": "Se você escolher um registro inicial de 1 e um número de bytes de 4, os comandos serão criados",
        "ReadCoil_1, ReadCoil_2, ReadCoil_3, ReadCoil_4": "ReadCoil_1, ReadCoil_2, ReadCoil_3, ReadCoil_4",
        "Vous pouvez bien sur renommer ensuite les ReadCoils\/Discretes à votre convenance": "Você pode, é claro, renomear os ReadCoils\/Discretes ao seu gosto",
        "Pour les Holdings Registers et les Inputs Registers": "Para Registros de Participações e Registros de Entradas",
        "Vous choisissez une commande de type Info, sous type Numerique": "Você escolhe um comando de tipo de informação, em tipo numérico",
        "Choisir le format correspondant": "Escolha o formato correspondente",
        "Float , Long\/Integer ou Bits": "Float , Long\/Integer ou Bits",
        "FC04 ou FC03": "FC04 ou FC03",
        "Le Registre de depart ainsi que le nombre de bytes": "O registrador inicial, bem como o número de bytes",
        "pour les floats, le maximum de registres encodé est de 4 registres": "para floats, o número máximo de registros codificados é de 4 registros",
        "COMMANDES D'ECRITURE": "COMANDOS DE ESCREVA",
        "Sur votre équipements, par défaut il y aura 3 commandes de type Action\/message créées; Ecriture MultiRegistre, Ecriture Bit et Ecriture multicoils": "No seu equipamento, por padrão, serão criados 3 comandos do tipo Ação\/mensagem; Gravação MultiRegister, Gravação de Bit e Gravação Multicoil",
        "Leur principe de fonctionnement": "Seu princípio de funcionamento",
        "Ecriture MultiRegistre": "Gravação de vários registros",
        "dans la configuration de la commande, il vous faut rentrer le registre de départ, ainsi que l'ordre des bytes et word": "na configuração do comando, deve-se informar o registrador inicial, assim como a ordem dos bytes e da palavra",
        "Par défaut, le fonctionCode est de fc16": "Por padrão, o functionCode é FC16",
        "Veuillez laisser cette configuration par défaut": "Por favor, deixe esta configuração como padrão",
        "Pour changer les valeurs sur les registres, il faut utiliser cette syntaxe": "Para alterar os valores nos registros, use esta sintaxe",
        "5&4      Nous envoyons l'entier 120 sur un registre, en partant du registre de départ configuré": "5&4 Enviamos o inteiro 120 para um registrador, a partir do registrador inicial configurado",
        "puis 214": "então 214",
        "5 en float sur 4 registres suivant le précédent": "5 em float em 4 registros seguindo o anterior",
        "Pour les types float, écrire la valeur comme ci dessus, avec un": "Para tipos float, escreva o valor como acima, com um",
        "Ecriture MultiCoils": "Gravação MultiCoil",
        "dans la configuration de la commande, il vous faut rentrer le registre de départ": "na configuração do comando, você deve inserir o registro inicial",
        "Par défaut, le fonctionCode est de fc15": "Por padrão, o functionCode é fc15",
        "01110111    Cela enverra donc à partir du registre de départ configuré les valeurs True(1) ou False(0) aux registres": "01110111 Então isso vai enviar do registrador inicial configurado os valores True(1) ou False(0) para os registradores",
        "Ecriture Bit": "Escrever Bit",
        "Par défaut, le fonctionCode est de fc03, car cette commande sera a donner la valeur du registre parametré en binaire à la commande info \"infobitbinary": "Por padrão, o functionCode é fc03, pois este comando dará o valor do registrador configurado em binário para o comando info \"infobitbinary",
        "Sur la commande info \"infobitbinary\", vous aurez la valeur binaire du registre parametre à la commande Ecriture Bit": "No comando info \"infobitbinary\", você terá o valor binário do registrador de parâmetro no comando Write Bit",
        "Pour changer le bit sur le registre": "Para alterar o bit no registro",
        "valeuraenvoyer&PositionBit": "valorpara enviar&PositionBit",
        "1&4      Nous envoyons la valeur 1 au bit de la position 4 en partant de la droite": "1&4 Enviamos o valor 1 para o bit da posição 4 começando pela direita",
        "Sur la commande info \"infobitbinary\", vous voyez la valeur 10000101, qui correspond a la valeur binaire du registre parametre": "No comando info \"infobitbinary\", você vê o valor 10000101, que corresponde ao valor binário do registrador de parâmetro",
        "En ecrivant 1&6, vous aurez dorenavant la valeur": "Ao escrever 1&6, você terá agora o valor",
        "10100101 sur le registre parametré": "10100101 no registrador configurado",
        "Pour écrire sur un Coil": "Para escrever em uma bobina",
        "Exemple pour le registre 1 On": "Exemplo para registro 1 On",
        "Vous choisissez une commande de type Action, sous type Defaut": "Você escolhe um comando de tipo de ação, em tipo padrão",
        "Choisir Fc5 Write Single Coil": "Escolha Fc5 Write Single Coil",
        "Registre de depart": "Registro de partida",
        "Nb de bytes": "Número de bytes",
        "Mettre 1 dans valeur a envoyer": "Coloque 1 no valor para enviar",
        "Exemple pour le registre 1 Off": "Exemplo para registro 1 Off",
        "Mettre 0 dans valeur a envoyer": "Coloque 0 no valor para enviar",
        "En agissant sur ces commandes action sur votre dashboard, vous enverrez donc True ou False à vos Coils": "Ao agir sobre esses comandos de ação em seu painel, você enviará True ou False para suas bobinas",
        "Pour écrire sur un Holding Register": "Para gravar em um registro de retenção",
        "Vous choisissez une commande de type Action, sous type Slider": "Você escolhe um comando de tipo de ação, em tipo de controle deslizante",
        "Choisir Fc5 Write Single Register": "Escolha Fc5 Write Single Register",
        "Choisir le nombre de registre": "Escolha o número de registros",
        "1, 2 ou 4": "1, 2 ou 4",
        "Choisir le format à envoyer au registre (cela modifiera le type de slider sur votre dashboard, suivant qu'il soit float ou long\/integer": "Escolha o formato para enviar para o registro (isso irá alterar o tipo de controle deslizante em seu painel, dependendo se for flutuante ou longo\/inteiro",
        "Choisir le pas du slider (pour les décimales, écrire avec un": "Escolha o passo do controle deslizante (para decimais, escreva com um",
        "Choisir aussi une valeur Min et Max pour ce slider": "Escolha também um valor mínimo e máximo para este controle deslizante",
        " Modbus.": " Modbus.",
        " Modbus?": " Modbus?",
        "Modbus ": "Modbus ",
        " Modbus]": " Modbus]",
        "[Modbus]": "[Modbus]",
        "*Modbus*": "*Modbus*",
        " Modbus*": " Modbus*",
        " Description.": " Descrição.",
        " Description?": " Descrição?",
        "Description ": "Descrição ",
        " Description]": " Descrição]",
        "[Description]": "[Descrição]",
        "*Description*": "*Descrição*",
        " Description*": " Descrição*",
        " IMPORTANT.": " IMPORTANTE.",
        " IMPORTANT?": " IMPORTANTE?",
        "IMPORTANT ": "IMPORTANTE ",
        " IMPORTANT]": " IMPORTANTE]",
        "[IMPORTANT]": "[IMPORTANTE]",
        "*IMPORTANT*": "*IMPORTANTE*",
        " IMPORTANT*": " IMPORTANTE*",
        " Offset.": " Desvio.",
        " Offset?": " Desvio?",
        "Offset ": "Desvio ",
        " Offset]": " Desvio]",
        "[Offset]": "[Desvio]",
        "*Offset*": "*Desvio*",
        " Offset*": " Desvio*",
        " Ex.": " Ex.",
        " Ex?": " Ex?",
        "Ex ": "Ex ",
        " Ex]": " Ex]",
        "[Ex]": "[Ex]",
        "*Ex*": "*Ex*",
        " Ex*": " Ex*",
        " ex.": " Ex.",
        " ex?": " Ex?",
        "ex ": "Ex ",
        " ex]": " Ex]",
        "[ex]": "[Ex]",
        "*ex*": "*Ex*",
        " ex*": " Ex*"
    }
}